# Основные кнопки меню:

MAIN_MENU = "☰ Главное меню"
BACK = "⏎ Назад"
SUPPORT = "⛭ Поддержка"
CHANNEL = "✤ Канал"
ABOUT_VPN = "ⓘ Техподдержка"
TARIFF = "≣ Тарифы"  # Новая кнопка
APPLY = "✓ Подтвердить"
CANCEL = "✕ Отмена"

# Профиль

ADD_SUB = "✛ Купить VPN"
MY_SUBS = "☰ Мои подписки"
BALANCE = "₽ Баланс"
INVITE = "➤ Реферальная программа"
INVFREND = "➤ Пригласить друга"
GIFTS = "♡ Подарить"
INSTRUCTIONS = "📘 Инструкции"
TOP_FIVE = "⚝ Топ-5"
TRIAL_SUB = "🎁 Пробная подписка"
MY_SUB = "🔐 Моя подписка"

# Меню Оплат и баланса

BALANCE_HISTORY = "⟲ История пополнения"
PAYMENT = "+ Пополнить баланс"
COUPON = "▭ Активировать купон"
COUPON_RESTART = "# Попробовать другой купон"
YOOKASSA = "↷ ЮКасса: быстрая оплата"
YOOMONEY = "↷ ЮМани: перевод по карте"
CRYPTOBOT = "₿ CryptoBot: криптовалюта"
STARS = "★ Оплата Звездами"
ROBOKASSA = "★ RoboKassa"
DISCOUNT_TARIFF = "🔥 Получить скидку"
MAX_DISCOUNT_TARIFF = "⚡ Получить максимальную скидку"

# Кнопки подписки на канал
SUB_CHANELL = "✤ Подписаться"
SUB_CHANELL_DONE = "✓ Я подписался"

# Подарки

GIFT = "🎁 Подарить подписку"
MY_GIFTS = "🎁 Мои подарки"
GIFTS_MENU = "В меню подарков"
SHARE_GIFT = "🎁 Поделиться подарком"
GET_GIFT = "🎁 Получить подарок"

# Создание и подключение ключей

DOWNLOAD_IOS_BUTTON = "🍏 Скачать iOS"
DOWNLOAD_ANDROID_BUTTON = "🤖 Скачать Android"
DOWNLOAD_MACOS_BUTTON = "🍏 Скачать macOS"
DOWNLOAD_PC_BUTTON = "💻 Скачать Windows"
IMPORT_IOS = "🍏 Подключить"
IMPORT_ANDROID = "🤖 Подключить"
PC_BUTTON = "💻 Компьютеры"
TV_BUTTON = "📺 Андроид TV"
CONNECT_PHONE = "📱 Подключить телефон"
CONNECT_DEVICE = "📲 Подключить устройство"
CONNECT_WINDOWS_BUTTON = "💻 Подключить"
CONNECT_MACOS_BUTTON = "🍏 Подключить"
ALIAS = "✏️"
UNFREEZE = "🟢 Разморозить подписку"
FREEZE = "🛑 Заморозить подписку"
RENEW = "⏳ Продлить"
RENEW_FULL = "⏳ Продлить подписку"
DELETE = "✕ Удалить"
CHANGE_LOCATION = "🌍 Сменить локацию"
QR = "⎘ Показать QR-код"
IPHONE = "🍏 Айфон"
ANDROID = "🤖 Андроид"
PC = "💻 Компьютер"
PC_PC = "💻 Windows"
PC_MACOS = "🍏 macOS"
TV = "📺 Телевизор"
ROUTER = "📶 Роутер"
MANUAL_INSTRUCTIONS = "📖 Ручная установка"
RENEW_KEY = "⟲ Продлить подписку"
TV_CONTINUE = "▶ Продолжить"
TV_INSTRUCTIONS = "📖 Полная инструкция"
HWID_BUTTON = "♻️ Сбросить привязку"

# Кнопки касс

PAY = "Пополнить"
PAY_2 = "Оплатить"
CUSTOM_AMOUNT = "⛭ Ввести свою сумму"
STARS_BOT = "★ Бот для покупки звезд"